In [82]:
import pandas as pd
import streamlit as st

In [83]:
df = pd.read_csv('Data.csv')

In [84]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [85]:
df.isna().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [86]:
df.dropna(inplace=True)

In [87]:
df.reset_index(inplace=True, drop=True) # 없는 인덱스는 초기화

In [88]:
df.isna().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

In [89]:
df.loc[ : , ['Country','Salary'] ]

   Country   Salary
0   France  72000.0
1    Spain  48000.0
2  Germany  54000.0
3    Spain  61000.0
4   France  58000.0
5   France  79000.0
6  Germany  83000.0
7   France  67000.0

In [90]:
X = df.loc[ : , : ]

In [91]:
X.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [92]:
X.columns[0] # 컬럼을 가져올때 인덱스 번호를 써서 가져온다.

'Country'

In [93]:
# 각 컬럽별로 문자인지 숫지인지 먼저 확인한다.
# 분자열이면, 2종류인지 3종류 이상의 데이터인지를 확인한다.
# 확인이 끝나면, 레이블인코딩이나 원핫 인코딩을 이용해서 숫자로 바꿔준다.

In [94]:
df[ X.columns[0] ].dtype == object

True

In [95]:
df[ X.columns[1] ].dtype == float

True

In [96]:
df[ X.columns[0] ].nunique() # 첫번째 컬럼의 유형갯수

3

In [97]:
# 원핫 인코딩은, 한번ㅇ에 여러컬럼이 가능하므로,
# 먼저, 레이블 인코딩이 가능한 컬럼 먼저 처리를 해주고 난후에
# 원핫 인코딩을 수행한다.

from sklearn.preprocessing import LabelEncoder, OneHotEncoder
from sklearn.compose import ColumnTransformer

In [98]:
X_new = pd.DataFrame()

# 컬럼이름 가져오기
for name in X.columns : 
    # print(name)

    # 데이터가 문자열이면, 데이터의 종류가 몇개인지 확인한다.
    if X[ name ].dtype == object :

       if X[ name ].nunique() >= 3 :
        # 원핫 인코딩한다.
        ct = ColumnTransformer([('encoder', OneHotEncoder() , [0] )],  # 'cncoder'는 아무거나 입력하면 됨
                       remainder= 'passthrough')
        
        col_names = sorted( X[name].unique() )

        X_new[col_names] = ct.fit_transform( X[ name ].to_frame() ) # 변환
        
       else :
        #  레이블 인코딩 한다.
        label_encoder = LabelEncoder()
        X_new[name] = label_encoder.fit_transform(X[name])
       

    # 숫자 데이터일때의 처리는 여기서 
    else :
      X_new[name] = X[name]

In [99]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4   France  35.0  58000.0       Yes
5   France  48.0  79000.0       Yes
6  Germany  50.0  83000.0        No
7   France  37.0  67000.0       Yes

In [100]:
X

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4   France  35.0  58000.0       Yes
5   France  48.0  79000.0       Yes
6  Germany  50.0  83000.0        No
7   France  37.0  67000.0       Yes

In [101]:
X_new

   France  Germany  Spain   Age   Salary  Purchased
0     1.0      0.0    0.0  44.0  72000.0          0
1     0.0      0.0    1.0  27.0  48000.0          1
2     0.0      1.0    0.0  30.0  54000.0          0
3     0.0      0.0    1.0  38.0  61000.0          0
4     1.0      0.0    0.0  35.0  58000.0          1
5     1.0      0.0    0.0  48.0  79000.0          1
6     0.0      1.0    0.0  50.0  83000.0          0
7     1.0      0.0    0.0  37.0  67000.0          1

In [102]:
sorted(X[X.columns[0]].unique()) # numpy에서는 'sorted' 를 사용하여 정렬한다.

['France', 'Germany', 'Spain']

In [103]:
# 원핫인코딩을 하면 결과가
# 1  0  0
# 0  1  0
# 0  0  1 
# 이렇게 된다.

In [104]:
X[X.columns[0] ].to_frame() # 1차원 판다스 프레임을 2차원으로 바꾸기위해 to.frame() 를 입력

   Country
0   France
1    Spain
2  Germany
3    Spain
4   France
5   France
6  Germany
7   France

In [105]:
ct = ColumnTransformer([('encoder', OneHotEncoder() , [0] )],  # 'cncoder'는 아무거나 입력하면 됨
                       remainder= 'passthrough')

In [106]:
ct.fit_transform( X [X.columns[0] ].to_frame() )

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.]])

In [107]:
sorted(X[ X.columns[0]].unique())

['France', 'Germany', 'Spain']

In [108]:
X[X.columns[3]].nunique()

2

In [109]:
label_encoder = LabelEncoder()
label_encoder.fit_transform(X [X.columns[3]])

array([0, 1, 0, 0, 1, 1, 0, 1])